src/pureba.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To SOAP-ENV:mustUnderstand="1">http://www.w3.org/2005/08/addressing/anonymous</wsa:To><wsa:Action>https://ws-si.mecon.gov.ar/ws/compras/consultarSaldoOrdenServiceResponse</wsa:Action><wsa:MessageID>urn:uuid:3c00a591-239f-426a-9775-3753449f2b03</wsa:MessageID><wsa:RelatesTo>urn:uuid:6113be59-0c5a-4d5c-bb93-8fe1d3c6a2dd</wsa:RelatesTo></SOAP-ENV:Header><SOAP-ENV:Body><ns3:consultarSaldoOrden xmlns:ns3="http://beans.webServices.compras.esidif.mecon.gov.ar" xmlns=""><importes><totalMO>321500000</totalMO><totalVigenteMO>321500000</totalVigenteMO><saldoMO>227545000</saldoMO><totalMCL>321500000</totalMCL><totalVigenteMCL>321500000</totalVigenteMCL><saldoMCL>227545000</saldoMCL></importes><itemsCatalogo><idItem>1</idItem><cantidad>300</cantidad><cantidadVigente>300</cantidadVigente><saldoCantidad>300</saldoCantidad><importeUnitarioMO>222750</importeUnitarioMO><importeUnitarioVigenteMO>222750</importeUnitarioVigenteMO><importeMO>66825000</importeMO><importeMCL>66825000</importeMCL><importeVigenteMO>66825000</importeVigenteMO><importeVigenteMCL>66825000</importeVigenteMCL><saldoImporteMO>66825000</saldoImporteMO><saldoImporteMCL>66825000</saldoImporteMCL></itemsCatalogo><itemsCatalogo><idItem>2</idItem><cantidad>700</cantidad><cantidadVigente>700</cantidadVigente><saldoCantidad>700</saldoCantidad><importeUnitarioMO>229600</importeUnitarioMO><importeUnitarioVigenteMO>229600</importeUnitarioVigenteMO><importeMO>160720000</importeMO><importeMCL>160720000</importeMCL><importeVigenteMO>160720000</importeVigenteMO><importeVigenteMCL>160720000</importeVigenteMCL><saldoImporteMO>160720000</saldoImporteMO><saldoImporteMCL>160720000</saldoImporteMCL></itemsCatalogo><itemsCatalogo><idItem>3</idItem><cantidad>300</cantidad><cantidadVigente>300</cantidadVigente><saldoCantidad>0</saldoCantidad><importeUnitarioMO>196700</importeUnitarioMO><importeUnitarioVigenteMO>196700</importeUnitarioVigenteMO><importeMO>59010000</importeMO><importeMCL>59010000</importeMCL><importeVigenteMO>59010000</importeVigenteMO><importeVigenteMCL>59010000</importeVigenteMCL><saldoImporteMO>0</saldoImporteMO><saldoImporteMCL>0</saldoImporteMCL></itemsCatalogo><itemsCatalogo><idItem>6</idItem><cantidad>1000</cantidad><cantidadVigente>1000</cantidadVigente><saldoCantidad>0</saldoCantidad><importeUnitarioMO>34945</importeUnitarioMO><importeUnitarioVigenteMO>34945</importeUnitarioVigenteMO><importeMO>34945000</importeMO><importeMCL>34945000</importeMCL><importeVigenteMO>34945000</importeVigenteMO><importeVigenteMCL>34945000</importeVigenteMCL><saldoImporteMO>0</saldoImporteMO><saldoImporteMCL>0</saldoImporteMCL></itemsCatalogo><itemsPresupuestarios><imputacionPresupuestaria><imputacionPresupuestaria>113180</imputacionPresupuestaria><jurisdiccion>41</jurisdiccion><subJurisdiccion>4</subJurisdiccion><entidad>0</entidad><ejercicio>2025</ejercicio><servicio>326</servicio><aperturaProgramatica>1.0.0.1.0</aperturaProgramatica><objetoGasto>4.4.0.0</objetoGasto><fuente>1.1</fuente><moneda>1</moneda><ubicaciongeografica>2</ubicaciongeografica><descripcionApg>Conducción y Administración</descripcionApg><pex>0</pex><bapin>148313</bapin></imputacionPresupuestaria><ejercicio>2025</ejercicio><unidadDescentralizada><codigo>156</codigo><descripcion>DIV. ARMAMENTO Y MUNICIÓN</descripcion></unidadDescentralizada><importeMO>155254608</importeMO><importeMCL>155254608</importeMCL><importeVigenteMO>156292074.74</importeVigenteMO><importeVigenteMCL>156292074.74</importeVigenteMCL><saldoMO>97282074.74</saldoMO><saldoMCL>97282074.74</saldoMCL></itemsPresupuestarios><itemsPresupuestarios><imputacionPresupuestaria><imputacionPresupuestaria>53561</imputacionPresupuestaria><jurisdiccion>41</jurisdiccion><subJurisdiccion>4</subJurisdiccion><entidad>0</entidad><ejercicio>2025</ejercicio><servicio>326</servicio><aperturaProgramatica>1.0.0.1.0</aperturaProgramatica><objetoGasto>2.7.3.0</objetoGasto><fuente>1.1</fuente><moneda>1</moneda><ubicaciongeografica>2</ubicaciongeografica><descripcionApg>Conducción y Administración</descripcionApg><pex>0</pex><bapin>0</bapin></imputacionPresupuestaria><ejercicio>2025</ejercicio><unidadDescentralizada><codigo>156</codigo><descripcion>DIV. ARMAMENTO Y MUNICIÓN</descripcion></unidadDescentralizada><importeMO>34945000</importeMO><importeMCL>34945000</importeMCL><importeVigenteMO>34945000</importeVigenteMO><importeVigenteMCL>34945000</importeVigenteMCL><saldoMO>0</saldoMO><saldoMCL>0</saldoMCL></itemsPresupuestarios><itemsPresupuestarios><imputacionPresupuestaria><imputacionPresupuestaria>113180</imputacionPresupuestaria><jurisdiccion>41</jurisdiccion><subJurisdiccion>4</subJurisdiccion><entidad>0</entidad><ejercicio>2025</ejercicio><servicio>326</servicio><aperturaProgramatica>1.0.0.1.0</aperturaProgramatica><objetoGasto>4.4.0.0</objetoGasto><fuente>1.1</fuente><moneda>1</moneda><ubicaciongeografica>2</ubicaciongeografica><descripcionApg>Conducción y Administración</descripcionApg><pex>0</pex><bapin>148313</bapin></imputacionPresupuestaria><ejercicio>2026</ejercicio><unidadDescentralizada><codigo>156</codigo><descripcion>DIV. ARMAMENTO Y MUNICIÓN</descripcion></unidadDescentralizada><importeMO>131300392</importeMO><importeMCL>131300392</importeMCL><importeVigenteMO>130262925.26</importeVigenteMO><importeVigenteMCL>130262925.26</importeVigenteMCL><saldoMO>130262925.26</saldoMO><saldoMCL>130262925.26</saldoMCL></itemsPresupuestarios></ns3:consultarSaldoOrden></SOAP-ENV:Body></SOAP-ENV:Envelope>